# vim: ft=ruby

require "socket"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "bat"
brew "coreutils"
brew "exa"
brew "fzf"
brew "gh"
brew "ghcup"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "git-interactive-rebase-tool"
brew "gnupg"
brew "grep"
brew "htop"
brew "httpie"
brew "jq"
brew "mas"
brew "p7zip"
brew "pgcli"
brew "pinentry-mac"
brew "rg"
brew "shellcheck"
brew "skhd"
brew "sponge"
brew "tig"
brew "tmux"
brew "tree"
brew "vim"
brew "wget"
brew "yabai"
brew "ykman"
brew "zsh"

cask "1password"
cask "alacritty"
cask "discord"
cask "firefox"
cask "font-cascadia-code-pl"
cask "keycastr"
cask "maccy"
cask "notunes"
cask "pocket-casts"
cask "spotify"
cask "slack"
cask "visual-studio-code"
cask "webstorm"

mas "Pixelmator", id: 407963104
mas "Xcode", id: 497799835

if Socket.gethostname.start_with? "R"
  brew "aws-vault"
  brew "awscli"
  brew "colima"
  brew "docker"
  brew "docker-compose"
  brew "docker-credential-helper"
  brew "openconnect"
  cask "google-chrome"
  cask "viscosity"
  cask "zulip"
end
