tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "antibody"
brew "awscli"
brew "bat"
brew "coreutils"
brew "exa"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "gnupg"
brew "gnu-tar" # required by fpm
brew "go"
brew "htop"
brew "interactive-rebase-tool"
brew "jq"
brew "mas"
brew "p7zip"
brew "parallel"
brew "postgresql", restart_service: true
brew "rg"
brew "shellcheck"
brew "skhd"
brew "sponge"
brew "tig"
brew "tmux"
brew "tree"
brew "wget"
brew "yabai"
brew "zsh"

cask "aerial"
cask "alacritty"
cask "aws-vault"
cask "clipy"
cask "datagrip"
cask "docker"
cask "eurkey"
cask "firefox"
cask "flowdock"
cask "font-cascadia-code-pl"
cask "google-chrome-canary"
cask "intellij-idea"
cask "java"
cask "keepassxc"
cask "keycastr"
cask "mactex-no-gui"
cask "microsoft-teams"
cask "pocket-casts"
cask "session-manager-plugin"
cask "sketch"
cask "slack"
cask "spotify"
cask "virtualbox"
cask "viscosity"
cask "visual-studio-code"
cask "vmware-fusion"
cask "webstorm"

mas "1Password", id: 1333542190
mas "Bear", id: 1091189122
mas "Highlight", id: 572867415
mas "Kaleidoscope", id: 587512244
mas "Pixelmator", id: 407963104
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
