akamud.vscode-theme-onedark
brunnerh.insert-unicode
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
GitHub.vscode-pull-request-github
haskell.haskell
justusadam.language-haskell
ms-python.python
ms-vscode.cpptools
ms-vsliveshare.vsliveshare
nicoespeon.abracadabra
redhat.vscode-xml
timonwong.shellcheck
vscodevim.vim
