akamud.vscode-theme-onedark
alanz.vscode-hie-server
brunnerh.insert-unicode
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
GitHub.vscode-pull-request-github
justusadam.language-haskell
ms-python.python
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
redhat.vscode-xml
teabyii.ayu
timonwong.shellcheck
vscodevim.vim
